In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
np.random.seed(25)
DF_obj=DataFrame(np.random.rand(36).reshape((6,6)),
                index=['row 1','row 2','row 3','row 4','row 5','row 6'],
                columns=['column 1','column 2','column 3','column 4','column 5','column 6'])
DF_obj

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
row 2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
row 3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
row 4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
row 5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
row 6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

## index

In [3]:
DF_obj.loc[['row 1','row 2'],['column 3','column 6']]

       column 3  column 6
row 1  0.278839  0.117376
row 2  0.556229  0.113041

In [4]:
#row 1 and 2 me 3rd and 6th column ka data print karo

In [5]:
DF_obj<.2

       column 1  column 2  column 3  column 4  column 5  column 6
row 1     False     False     False      True     False      True
row 2     False     False     False     False     False      True
row 3     False     False      True     False     False     False
row 4     False     False     False     False     False     False
row 5     False     False      True     False     False     False
row 6     False     False     False     False     False     False

In [6]:
#all the values less than 0.2 will show true

## handling missing data

In [8]:
missing=np.nan #nan=not a number
series_obj=Series(['row 1','row 2',missing,'row 4','row 5',missing])
series_obj

0    row 1
1    row 2
2      NaN
3    row 4
4    row 5
5      NaN
dtype: object

In [9]:
series_obj.isnull()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [10]:
series_obj.isnull().sum() #tells kitne nan hai

2

In [11]:
np.random.seed(25)
DF_obj=DataFrame(np.random.rand(36).reshape((6,6)))
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
3  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
4  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
5  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [14]:
#dataframe[start row:end row,col value]
DF_obj.loc[3:5,0]=missing
DF_obj.loc[1:4,5]=missing

In [15]:
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366       NaN
2  0.447031  0.585445  0.161985  0.520719  0.326051       NaN
3       NaN  0.836375  0.481343  0.516502  0.383048       NaN
4       NaN  0.559053  0.034450  0.719930  0.421004       NaN
5       NaN  0.900274  0.669612  0.456069  0.289804  0.525819

In [16]:
DF_obj.isnull().sum() #missing val col wise

0    3
1    0
2    0
3    0
4    0
5    4
dtype: int64

In [19]:
filled_Df=DF_obj.fillna(0)#fill 0 value inplace of NAN
filled_Df

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.000000
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.000000
3  0.000000  0.836375  0.481343  0.516502  0.383048  0.000000
4  0.000000  0.559053  0.034450  0.719930  0.421004  0.000000
5  0.000000  0.900274  0.669612  0.456069  0.289804  0.525819

In [20]:
#filling custom value in place of NAN
filled_Df=DF_obj.fillna({
    0:0.242424,
    5:0.232323
})
filled_Df

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.232323
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.232323
3  0.242424  0.836375  0.481343  0.516502  0.383048  0.232323
4  0.242424  0.559053  0.034450  0.719930  0.421004  0.232323
5  0.242424  0.900274  0.669612  0.456069  0.289804  0.525819

In [22]:
#filling via fillforward method
filled_Df=DF_obj.fillna(method='ffill')
filled_Df

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.117376
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.117376
3  0.447031  0.836375  0.481343  0.516502  0.383048  0.117376
4  0.447031  0.559053  0.034450  0.719930  0.421004  0.117376
5  0.447031  0.900274  0.669612  0.456069  0.289804  0.525819

In [24]:
DF_obj_nan=DF_obj.dropna() #deleting nan/dropping
DF_obj_nan

          0         1         2         3       4         5
0  0.870124  0.582277  0.278839  0.185911  0.4111  0.117376

### Creating Data Frame

In [25]:
DF_las=DataFrame({
    'id':[1,2,3,4,5],
    'Name':['Vishal','batman','A','D','E'],
    'age':[22,33,44,55,66]
})
DF_las

   id    Name  age
0   1  Vishal   22
1   2  batman   33
2   3       A   44
3   4       D   55
4   5       E   66

## Handling duplicate data

In [26]:
DF_las=DataFrame({
    'id':[1,2,3,4,4,5,5],
    'Name':['V','H','H','C','C','D','E'],
    'age':[21,90,34,34,34,21,23]
})
DF_las

   id Name  age
0   1    V   21
1   2    H   90
2   3    H   34
3   4    C   34
4   4    C   34
5   5    D   21
6   5    E   23

In [27]:
DF_las.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
6    False
dtype: bool

In [31]:
uin=input("Enter your name:")
phone=input("enter your fav number")
DF_las=DataFrame({
    'Name':[uin],
    'Phone':[phone]
})
DF_las

Enter your name:Praffulla
enter your fav number988888

        Name   Phone
0  Praffulla  988888

In [33]:
uin,phone=[],[]
for i in range(4):
    i=input("Enter your fav name")
    j=input("Enetr your fav phone")
    uin.append(i)
    phone.append(j)
d={
    'Name':uin,
    'Phone':phone
}
DF_las=DataFrame(d)
DF_las

Enter your fav namePraffulla
Enetr your fav phone988
Enter your fav nameraj
Enetr your fav phone988889
Enter your fav namea
Enetr your fav phone8952
Enter your fav namerfaf
Enetr your fav phone998845

        Name   Phone
0  Praffulla     988
1        raj  988889
2          a    8952
3       rfaf  998845

In [34]:
#important codes

In [35]:
#ravel function